kennyrob26/A7670_Library_for_STM32/Inc/AT_decoder.h
/*
 * AT_decoder.h
 *
 *  Created on: Sep 4, 2025
 *      Author: kenny
 */

#ifndef INC_AT_DECODER_H_
#define INC_AT_DECODER_H_

#include "string.h"
#include "stdint.h"
#include "stdlib.h"
#include "stm32g4xx_hal.h"

//#define AT_OK 1
//#define AT_ERROR 0

#define STATE_SEND_COMMAND 0
#define STATE_RECEIVE_COMMAND 1
#define STATE_WAIT_COMMAND 2



#define BUFFER_LENGTH 150
#define TIMEOUT 50

typedef enum
{
	AT_OK      = 0,		//OK     -> Tudo correu como o esperado
	AT_ERROR   = 1,		//ERROR  -> Algo deu errado
	AT_WAITING = 2,		//WAITING-> Estamos esperando a tarefa ser conclida
	AT_TIMEOUT = 3		//TIMEOUT-> O tempo para executar a tarefa estourou
}AT_Status;

typedef enum
{
	CMD_ERROR = 0,
	CMD_OK    = 1
} CMD_Status;

typedef enum AT_ResponseType
{
    AT_RT_Echo_Command  = 0,
    AT_RT_Response      = 1,
    AT_RT_MQTT_Response = 2,
    AT_RT_NULL          = 3
}AT_ResponseType;

typedef struct AT_Wait_Response
{
	uint32_t start_tick;
	uint32_t timeout;
	char expected_response[30];
	uint8_t waiting_status;
}AT_Wait_Response;

typedef struct AT_INFO
{
	UART_HandleTypeDef *huart;
	char at_command[50];
	volatile uint8_t response_buffer[BUFFER_LENGTH];
    char *echo;
    char *response;
    char *OK;
    uint8_t status;
    volatile uint8_t existMessage;
    AT_Wait_Response wait_response;
}AT_INFO;

extern AT_INFO at;


//void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size);
//void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart);

AT_Status AT_defineUART(UART_HandleTypeDef *huartx);
AT_Status AT_config_Wait_Response(const char *expected_response, uint32_t timeout);
AT_Status AT_check_Wait_Response();
AT_Status AT_check_Wait_Response_Blocking();
AT_Status AT_sendCommand(char *expected_response, uint16_t timeout);
AT_Status AT_Exist_New_Message(uint16_t timeout);



#endif /* INC_AT_DECODER_H_ */
